local data = {}

--位置信息
data.area = {
    [1] = {
        startIndex = 1,
        map = {
            {0,1,1,0},
            {0,1,1,1},
            {1,1,1,1},
            {1,1,1,0},
            {1,1,1,0},
        }
    },
    [2] = {
        startIndex = 16,
        map = {
            {1,1,1},
            {1,1,1},
            {1,1,0},
            {1,1,0},
            {1,1,0}
        }
    },
    [3] = {
        startIndex = 28,
        map = {
            {1,1,1,0},
            {1,1,1,0},
            {1,1,1,0},
            {0,1,1,1},
            {0,1,1,1}
        }
    },
    [4] = {
        startIndex = 43,
        map = {
            {1,1,1,1},
            {1,1,1,1},
            {1,1,1,1},
            {0,0,1,1},
            {0,0,1,1}
        }
    },
    [5] = {
        startIndex = 59,
        map = {
            {1,1,0},
            {1,1,0},
            {1,1,1},
            {1,1,1},
            {0,1,1}
        }
    },
    [6] = {
        startIndex = 71,
        map = {
            {1,1,1,1},
            {1,1,1,1},
            {1,1,1,1},
            {1,1,1,0}
        }
    } 
}

--店铺点数信息
data.shop = {
    [1] = 3,
    [2] = 3,
    [3] = 3,
    [4] = 4,
    [5] = 4,
    [6] = 4,
    [7] = 5,
    [8] = 5,
    [9] = 5,
    [10] = 6,
    [11] = 6,
    [12] = 6,
}
--发卡数量
data.cards = {
    [3] = {
        7,6,6,6,6,6
    },
    [4] = {
        6,5,5,5,5,5
    },
    [5] = {
        5,5,5,4,4,4
    }

}
--收益
data.income = {
    [1] = {
        complete = 10000,
        incomplete = 10000
    },
    [2] = {
        complete = 20000,
        incomplete = 20000
    },
    [3] = {
        complete = 50000,
        incomplete = 40000
    },
    [4] = {
        complete = 80000,
        incomplete = 60000
    },
    [5] = {
        complete = 110000,
        incomplete = 80000
    },
    [6] = {
        complete = 140000,
        incomplete = 140000
    }
}
--开始资金
data.startMoney = 50000
--总年数
data.yearMax = 6

return data